Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/edc/PIC32MK0512GPH048.PIC
      <edc:SFRDef edc:_addr="0x1F81091C" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF247" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF247" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810920" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F810924" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF249" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF249" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810928" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF250" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF250" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F81092C" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF251" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF251" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810930" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF252" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF252" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810934" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F810938" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF254" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF254" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F81093C" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF255" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF254" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810940" edc:offset="0x6c0"/>
      <edc:SFRDef edc:_addr="0x1F811000" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="----------------nn-nn-----------" edc:cname="DMACON" edc:desc="" edc:impl="0xd800" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00-00-----------" edc:name="DMACON" edc:nzwidth="32" edc:por="----------------00-00-----------" edc:portals="CLR SET INV" ltx:baseofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="DMABUSY" edc:desc="" edc:mask="0x1" edc:name="DMABUSY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SUSPEND" edc:desc="" edc:mask="0x1" edc:name="SUSPEND" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="DMA" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811010" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="r----------------------------rrr" edc:cname="DMASTAT" edc:desc="" edc:impl="0x80000007" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----------------------------000" edc:name="DMASTAT" edc:nzwidth="32" edc:por="0----------------------------000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMACH" edc:desc="" edc:mask="0x7" edc:name="DMACH" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="15"/>
            <edc:SFRFieldDef edc:cname="RDWR" edc:desc="" edc:mask="0x1" edc:name="RDWR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811020" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMAADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DMAADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAADDR" edc:desc="" edc:mask="0xffffffff" edc:name="DMAADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811030" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="--nnn--n-----------nnnnnnnn--nnn" edc:cname="DCRCCON" edc:desc="" edc:impl="0x39001fe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000--0-----------00000000--000" edc:name="DCRCCON" edc:nzwidth="32" edc:por="--000--0-----------00000000--000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CRCCH" edc:desc="" edc:mask="0x7" edc:name="CRCCH" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CRCTYP" edc:desc="" edc:mask="0x1" edc:name="CRCTYP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CRCAPP" edc:desc="" edc:mask="0x1" edc:name="CRCAPP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CRCEN" edc:desc="" edc:mask="0x1" edc:name="CRCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0x1f" edc:name="PLEN" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="BITO" edc:desc="" edc:mask="0x1" edc:name="BITO" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="WBO" edc:desc="" edc:mask="0x1" edc:name="WBO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BYTO" edc:desc="" edc:mask="0x3" edc:name="BYTO" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811040" edc:_begin="0x0" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCRCDATA" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DCRCDATA" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCRCDATA" edc:desc="" edc:mask="0xffffffff" edc:name="DCRCDATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
