Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/edc/PIC32MK0512GPH048.PIC
      <edc:AdjustPoint edc:_addr="0x1F8F8C54" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8F8C58" edc:_begin="0x20" edc:_end="0x24" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="55" edc:access="----------------------------nnnn" edc:cname="SBT3WR0" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT3WR0" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8F8C5C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8F8C60" edc:_begin="0x18" edc:_end="0x1c" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="56" edc:access="nnnnnnnnnnnnnnnnnnnnnnr-nnnnn---" edc:cname="SBT3REG1" edc:desc="" edc:impl="0xfffffef8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000x-00000---" edc:name="SBT3REG1" edc:nzwidth="32" edc:por="0000000000000000000000x-00000---" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1f" edc:name="SIZE" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI" edc:desc="" edc:mask="0x1" edc:name="PRI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="" edc:mask="0x3fffff" edc:name="BASE" edc:nzwidth="22"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8F8C64" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F8F8C70" edc:_begin="0x1c" edc:_end="0x20" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="57" edc:access="----------------------------nnnn" edc:cname="SBT3RD1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT3RD1" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8F8C74" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8F8C78" edc:_begin="0x20" edc:_end="0x24" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="58" edc:access="----------------------------nnnn" edc:cname="SBT3WR1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT3WR1" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8F8C7C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8F8C80" edc:_begin="0x18" edc:_end="0x1c" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="59" edc:access="nnnnnnnnnnnnnnnnnnnnnnr-nnnnn---" edc:cname="SBT3REG2" edc:desc="" edc:impl="0xfffffef8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000x-00000---" edc:name="SBT3REG2" edc:nzwidth="32" edc:por="0000000000000000000000x-00000---" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1f" edc:name="SIZE" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI" edc:desc="" edc:mask="0x1" edc:name="PRI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="" edc:mask="0x3fffff" edc:name="BASE" edc:nzwidth="22"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8F8C84" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F8F8C90" edc:_begin="0x1c" edc:_end="0x20" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="60" edc:access="----------------------------nnnn" edc:cname="SBT3RD2" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT3RD2" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8F8C94" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8F8C98" edc:_begin="0x20" edc:_end="0x24" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="61" edc:access="----------------------------nnnn" edc:cname="SBT3WR2" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT3WR2" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
  </edc:PhysicalSpace>
  <edc:PinList edc:desc="PIC32MK0512GPH048" edc:ppsflavor="complex-grouped">
    <edc:Pin>
      <edc:VirtualPin edc:name="TCK"/>
      <edc:VirtualPin edc:name="RPA7" edc:ppsgroup="3" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="PWML4"/>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPB14" edc:ppsgroup="4" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="PWMH1"/>
      <edc:VirtualPin edc:name="RB14"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPB15" edc:ppsgroup="1" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="PWML1"/>
      <edc:VirtualPin edc:name="RB15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="RPA12" edc:ppsgroup="2" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="FLT13"/>
      <edc:VirtualPin edc:name="RA12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="RPA11" edc:ppsgroup="1" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="FLT14"/>
      <edc:VirtualPin edc:name="RA11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OA2OUT"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="C2IN4-"/>
      <edc:VirtualPin edc:name="C4IN3-"/>
      <edc:VirtualPin edc:name="RPA0" edc:ppsgroup="1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="RA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OA2IN+"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="C2IN+"/>
      <edc:VirtualPin edc:name="RPA1" edc:ppsgroup="2" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="RA1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGD3"/>
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="OA2IN-"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="C2IN1-"/>
      <edc:VirtualPin edc:name="RPB0" edc:ppsgroup="4" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGC3"/>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="OA1OUT"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="C1IN4-"/>
      <edc:VirtualPin edc:name="C4IN2-"/>
      <edc:VirtualPin edc:name="RPB1" edc:ppsgroup="2" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGC1"/>
      <edc:VirtualPin edc:name="OA1IN+"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="C1IN1+"/>
      <edc:VirtualPin edc:name="C1IN3-"/>
      <edc:VirtualPin edc:name="C2IN3-"/>
      <edc:VirtualPin edc:name="RPB2" edc:ppsgroup="3" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGD1"/>
      <edc:VirtualPin edc:name="OA1IN-"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="C1IN1-"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="RPB3" edc:ppsgroup="1" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="RB3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OA3OUT"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="C3IN4-"/>
      <edc:VirtualPin edc:name="C4IN1+"/>
      <edc:VirtualPin edc:name="C4IN4-"/>
      <edc:VirtualPin edc:name="RPC0" edc:ppsgroup="1" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="RC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OA3IN-"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="C3IN1-"/>
      <edc:VirtualPin edc:name="C4IN1-"/>
      <edc:VirtualPin edc:name="RPC1" edc:ppsgroup="3" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="RC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OA3IN+"/>
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="C3IN1+"/>
      <edc:VirtualPin edc:name="C3IN3-"/>
      <edc:VirtualPin edc:name="RPC2" edc:ppsgroup="4" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="FLT3"/>
      <edc:VirtualPin edc:name="RC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="C1IN2-"/>
      <edc:VirtualPin edc:name="FLT4"/>
      <edc:VirtualPin edc:name="RC11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TDI"/>
      <edc:VirtualPin edc:name="DAC3"/>
      <edc:VirtualPin edc:name="AN26"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="RPA8" edc:ppsgroup="2" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="RA8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="FLT15"/>
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="RPB4" edc:ppsgroup="1" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="RB4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OA5IN+"/>
      <edc:VirtualPin edc:name="AN24"/>
      <edc:VirtualPin edc:name="C5IN1+"/>
      <edc:VirtualPin edc:name="C5IN3-"/>
      <edc:VirtualPin edc:name="RPA4" edc:ppsgroup="3" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="RA4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OSCI"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="AN49"/>
      <edc:VirtualPin edc:name="RPC12" edc:ppsgroup="4" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="RC12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OSCO"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="RPC15" edc:ppsgroup="3" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="RC15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGD2"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RPB5" edc:ppsgroup="2" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGC2"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RPB6" edc:ppsgroup="3" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="RB6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="DAC2"/>
      <edc:VirtualPin edc:name="AN48"/>
      <edc:VirtualPin edc:name="RPC10" edc:ppsgroup="4" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="RC10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OA5OUT"/>
      <edc:VirtualPin edc:name="AN25"/>
      <edc:VirtualPin edc:name="C5IN4-"/>
      <edc:VirtualPin edc:name="RPB7" edc:ppsgroup="1" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="RB7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="RPC13" edc:ppsgroup="3" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="RC13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="RPB8" edc:ppsgroup="2" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RB8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TMS"/>
      <edc:VirtualPin edc:name="OA5IN-"/>
      <edc:VirtualPin edc:name="AN27"/>
      <edc:VirtualPin edc:name="C5IN1-"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="RPB9" edc:ppsgroup="4" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="RB9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPC6" edc:ppsgroup="3" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="PWMH6"/>
      <edc:VirtualPin edc:name="RC6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPC7" edc:ppsgroup="1" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="PWML6"/>
      <edc:VirtualPin edc:name="RC7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPC8" edc:ppsgroup="2" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="PWMH5"/>
      <edc:VirtualPin edc:name="RC8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPC9" edc:ppsgroup="4" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="PWML5"/>
      <edc:VirtualPin edc:name="RC9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPB10" edc:ppsgroup="4" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="PWMH3"/>
      <edc:VirtualPin edc:name="RB10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPB11" edc:ppsgroup="2" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="PWML3"/>
      <edc:VirtualPin edc:name="RB11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPB12" edc:ppsgroup="2" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="PWMH2"/>
      <edc:VirtualPin edc:name="RB12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RPB13" edc:ppsgroup="3" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="PWML2"/>
      <edc:VirtualPin edc:name="RB13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TDO"/>
      <edc:VirtualPin edc:name="PWMH4"/>
      <edc:VirtualPin edc:name="RA10"/>
    </edc:Pin>
